In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_excel('data.xlsx')
df

,sr_no,old_emp_id,name,address,mobile,degree1,specialisation1,college1,degree2,specialisation2,college2,degree3,specialisation3,college3,emp_status
0,1,24,Amit,ABC Road,356363474,Computer Science,Robotics,IIT Delhi,MSC,ML,MIT,PHD,AI,Harvard,full-time
1,2,34,Samit,Xyz Road,367474748,Bachelor of Arts,Economics,Delih Univ,Masters of Eco,Internatioal Relation,Delhi Univ,PHD,Foreign Trade,Delhi Univ,part-time
2,3,56,Richard,PTC Street,363637677,Bsc,Biology,Mumbai Univ,Masters of Science,Microbiology,Mumbai Univ,PHD,Communicable disease,Mumbai Univ,part-time

In [ ]:
for index,row in df.iterrows():
    
    #further processing on row of data to push it to a web-application
    # how to sub-iterate on degree,specialisation,college as rows for each sr_no